import { Task_Task } from './types'

export const Tasks: Task_Task[] = [
  {
    id: 0,
    title: 'Упрощенный путь',
    complexity: 'Легкий',
    task: 'Реализовать функцию shortenPath(path) , которая упрощает абсолютный Unix-путь и возвращает его каноническое представление, обрабатывая  . ,  .. и множественные  /.',
    bank: 'Т-банк',
    time: 10,
  },

  {
    id: 1,
    title: 'Упрощенный путь',
    complexity: 'Легкий',
    task: 'Реализовать функцию shortenPath(path) , которая упрощает абсолютный Unix-путь и возвращает его каноническое представление, обрабатывая  . ,  .. и множественные  /.',
    bank: 'Т-банк',
    time: 10,
  },

  {
    id: 2,
    title: 'Упрощенный путь',
    complexity: 'Легкий',
    task: 'Реализовать функцию shortenPath(path) , которая упрощает абсолютный Unix-путь и возвращает его каноническое представление, обрабатывая  . ,  .. и множественные  /.',
    bank: 'Т-банк',
    time: 10,
  },

  {
    id: 3,
    title: 'Упрощенный путь',
    complexity: 'Легкий',
    task: 'Реализовать функцию shortenPath(path) , которая упрощает абсолютный Unix-путь и возвращает его каноническое представление, обрабатывая  . ,  .. и множественные  /.',
    bank: 'Т-банк',
    time: 10,
  },

  {
    id: 4,
    title: 'Упрощенный путь',
    complexity: 'Легкий',
    task: 'Реализовать функцию shortenPath(path) , которая упрощает абсолютный Unix-путь и возвращает его каноническое представление, обрабатывая  . ,  .. и множественные  /.',
    bank: 'Т-банк',
    time: 10,
  },

  {
    id: 5,
    title: 'Сутулый путь',
    complexity: 'Легкий',
    task: 'Реализовать функцию shortenPath(path) , которая упрощает абсолютный Unix-путь и возвращает его каноническое представление, обрабатывая  . ,  .. и множественные  /.',
    bank: 'Т-банк',
    time: 10,
  },

  {
    id: 6,
    title: 'Упрощенный путь',
    complexity: 'Легкий',
    task: 'Реализовать функцию shortenPath(path) , которая упрощает абсолютный Unix-путь и возвращает его каноническое представление, обрабатывая  . ,  .. и множественные  /.',
    bank: 'Сбер',
    time: 10,
  },

  {
    id: 7,
    title: 'Упрощенный путь',
    complexity: 'Сложный',
    task: 'Реализовать функцию shortenPath(path) , которая упрощает абсолютный Unix-путь и возвращает его каноническое представление, обрабатывая  . ,  .. и множественные  /.',
    bank: 'Т-банк',
    time: 10,
  },

  {
    id: 8,
    title: 'Упрощенный путь',
    complexity: 'Легкий',
    task: 'Реализовать функцию shortenPath(path) , которая упрощает абсолютный Unix-путь и возвращает его каноническое представление, обрабатывая  . ,  .. и множественные  /.',
    bank: 'Т-банк',
    time: 10,
  },

  {
    id: 9,
    title: 'Упрощенный путь',
    complexity: 'Легкий',
    task: 'Реализовать функцию shortenPath(path) , которая упрощает абсолютный Unix-путь и возвращает его каноническое представление, обрабатывая  . ,  .. и множественные  /.',
    bank: 'Т-банк',
    time: 10,
  },

  {
    id: 10,
    title: 'Упрощенный путь',
    complexity: 'Легкий',
    task: 'Реализовать функцию shortenPath(path) , которая упрощает абсолютный Unix-путь и возвращает его каноническое представление, обрабатывая  . ,  .. и множественные  /.',
    bank: 'Т-банк',
    time: 10,
  },

  {
    id: 11,
    title: 'Упрощенный путь',
    complexity: 'Легкий',
    task: 'Реализовать функцию shortenPath(path) , которая упрощает абсолютный Unix-путь и возвращает его каноническое представление, обрабатывая  . ,  .. и множественные  /.',
    bank: 'Т-банк',
    time: 10,
  },

  {
    id: 12,
    title: 'Упрощенный путь',
    complexity: 'Легкий',
    task: 'Реализовать функцию shortenPath(path) , которая упрощает абсолютный Unix-путь и возвращает его каноническое представление, обрабатывая  . ,  .. и множественные  /.',
    bank: 'Т-банк',
    time: 10,
  },

  {
    id: 13,
    title: 'Упрощенный путь',
    complexity: 'Легкий',
    task: 'Реализовать функцию shortenPath(path) , которая упрощает абсолютный Unix-путь и возвращает его каноническое представление, обрабатывая  . ,  .. и множественные  /.',
    bank: 'Т-банк',
    time: 10,
  }
];