import { Question } from './types'

export const questions: Question[] = [
  {
    id: 0,
    title: 'Next.js',
    answer: 'Фреймворк на основе React для разработки северных и статистических веб-приложений, с встроенной поддержкой SSR, SSG, и ISR'
  },

  {
    id: 1,
    title: 'Python',
    answer: 'Фреймворк на основе React для разработки северных и статистических веб-приложений, с встроенной поддержкой SSR, SSG, и ISR'
  },

  {
    id: 2,
    title: 'React',
    answer: 'Фреймворк на основе React для разработки северных и статистических веб-приложений, с встроенной поддержкой SSR, SSG, и ISR'
  },

  {
    id: 3,
    title: 'JavaScript',
    answer: 'Фреймворк на основе React для разработки северных и статистических веб-приложений, с встроенной поддержкой SSR, SSG, и ISR'
  },

  {
    id: 4,
    title: 'CSS',
    answer: 'Фреймворк на основе React для разработки северных и статистических веб-приложений, с встроенной поддержкой SSR, SSG, и ISR'
  },

  {
    id: 5,
    title: 'Docker',
    answer: 'Фреймворк на основе React для разработки северных и статистических веб-приложений, с встроенной поддержкой SSR, SSG, и ISR'
  },

  {
    id: 6,
    title: 'SQL',
    answer: 'Фреймворк на основе React для разработки северных и статистических веб-приложений, с встроенной поддержкой SSR, SSG, и ISR'
  },

  {
    id: 7,
    title: 'HTML',
    answer: 'Фреймворк на основе React для разработки северных и статистических веб-приложений, с встроенной поддержкой SSR, SSG, и ISR'
  },

  {
    id: 8,
    title: 'TypeScript',
    answer: 'Фреймворк на основе React для разработки северных и статистических веб-приложений, с встроенной поддержкой SSR, SSG, и ISR'
  }
  
];  